name: "VGG_ILSVRC_16_layers"

input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 224
  dim: 224
}

input: "rois"
input_shape {
  dim: 1 # to be changed on-the-fly to num ROIs
  dim: 5 # [batch ind, x1, y1, x2, y2] zero-based indexing
}

input: "im_info"
input_shape {
  dim: 1
  dim: 3
}

layer { name: "conv1_1" type: "Convolution" bottom: "data" top: "conv1_1"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 64 pad_h: 0 pad_w: 3 kernel_h: 1 kernel_w: 7
  stride_h: 1 stride_w: 2 weight_filler { type: "xavier" } } }
layer { name: "relu1_1" type: "ReLU" bottom: "conv1_1" top: "conv1_1" }
layer { name: "conv1_2" type: "Convolution" bottom: "conv1_1" top: "conv1_2"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 64 pad_h: 3 pad_w: 0 kernel_h: 7 kernel_w: 1
  stride_h: 2 stride_w: 1 weight_filler { type: "xavier" } } }
layer { name: "relu1_2" type: "ReLU" bottom: "conv1_2" top: "conv1_2" }
layer { name: "pool1" type: "Pooling" bottom: "conv1_2" top: "pool1"
	pooling_param { kernel_size: 3 stride: 2 pool: MAX } }

layer { name: "conv2a" type: "Convolution" bottom: "pool1" top: "conv2a"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 96 pad: 0 kernel_size: 1 stride: 2
  weight_filler { type: "xavier" } } }
layer { name: "conv2b_1" type: "Convolution" bottom: "pool1" top: "conv2b_1"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 96 pad: 1 kernel_size: 3 stride: 1
  weight_filler { type: "xavier" } } }
layer { name: "relu2b_1" type: "ReLU" bottom: "conv2b_1" top: "conv2b_1" }
layer { name: "conv2b_2" type: "Convolution" bottom: "conv2b_1" top: "conv2b_2"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 96 pad: 1 kernel_size: 3 stride: 2
  weight_filler { type: "xavier" } } }
layer { name: "relu2b_2" type: "ReLU" bottom: "conv2b_2" top: "conv2b_2" }
layer { name: "conv2b_3" type: "Convolution" bottom: "conv2b_2" top: "conv2b_3"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 96 pad: 0 kernel_size: 1 stride: 1
  weight_filler { type: "xavier" } } }
layer { name: "conv2" type: "Eltwise" bottom: "conv2a" bottom: "conv2b_3"
  top: "conv2" eltwise_param { operation: SUM } }

layer { name: "conv3a" type: "Convolution" bottom: "conv2" top: "conv3a"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 128 pad: 0 kernel_size: 1 stride: 2
  weight_filler { type: "xavier" } } }
layer { name: "conv3b_1" type: "Convolution" bottom: "conv2" top: "conv3b_1"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 128 pad: 0 kernel_size: 1 stride: 1
  weight_filler { type: "xavier" } } }
layer { name: "conv3b_2" type: "Convolution" bottom: "conv3b_1" top: "conv3b_2"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 128 pad_h: 0 pad_w: 3 kernel_h: 1 kernel_w: 7
  stride_h: 1 stride_w: 1 weight_filler { type: "xavier" } } }
layer { name: "relu3b_2" type: "ReLU" bottom: "conv3b_2" top: "conv3b_2" }
layer { name: "conv3b_3" type: "Convolution" bottom: "conv3b_2" top: "conv3b_3"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 128 pad_h: 3 pad_w: 0 kernel_h: 7 kernel_w: 1
  stride_h: 1 stride_w: 1 weight_filler { type: "xavier" } } }
layer { name: "relu3b_3" type: "ReLU" bottom: "conv3b_3" top: "conv3b_3" }
layer { name: "conv3b_4" type: "Convolution" bottom: "conv3b_3" top: "conv3b_4"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 128 pad: 1 kernel_size: 3 stride: 2
  weight_filler { type: "xavier" } } }
layer { name: "relu3b_4" type: "ReLU" bottom: "conv3b_4" top: "conv3b_4" }
layer { name: "conv3" type: "Eltwise" bottom: "conv3a" bottom: "conv3b_4"
  top: "conv3" eltwise_param { operation: SUM } }

layer { name: "conv4a" type: "Convolution" bottom: "conv3" top: "conv4a"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 256 pad: 0 kernel_size: 1 stride: 1
  weight_filler { type: "xavier" } } }
layer { name: "conv4b_1" type: "Convolution" bottom: "conv3" top: "conv4b_1"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 256 pad: 0 kernel_size: 1 stride: 1
  weight_filler { type: "xavier" } } }
layer { name: "conv4b_2" type: "Convolution" bottom: "conv4b_1" top: "conv4b_2"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 256 pad_h: 0 pad_w: 3 kernel_h: 1 kernel_w: 7
  stride_h: 1 stride_w: 1 weight_filler { type: "xavier" } } }
layer { name: "relu4b_2" type: "ReLU" bottom: "conv4b_2" top: "conv4b_2" }
layer { name: "conv4b_3" type: "Convolution" bottom: "conv4b_2" top: "conv4b_3"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 256 pad_h: 3 pad_w: 0 kernel_h: 7 kernel_w: 1
  stride_h: 1 stride_w: 1 weight_filler { type: "xavier" } } }
layer { name: "relu4b_3" type: "ReLU" bottom: "conv4b_3" top: "conv4b_3" }
layer { name: "conv4b_4" type: "Convolution" bottom: "conv4b_3" top: "conv4b_4"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 256 pad: 1 kernel_size: 3 stride: 1
  weight_filler { type: "xavier" } } }
layer { name: "relu4b_4" type: "ReLU" bottom: "conv4b_4" top: "conv4b_4" }
layer { name: "conv4" type: "Eltwise" bottom: "conv4a" bottom: "conv4b_4"
  top: "conv4" eltwise_param { operation: SUM } }

#======================== object proposal reranking ========================
layer { name: "conv5" type: "Convolution" bottom: "conv4" top: "conv5"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 256 pad: 0 kernel_size: 1 stride: 1
  weight_filler { type: "xavier" } } }
layer { name: "roi_pool" type: "ROIPooling" bottom: "conv5"
  bottom: "rois" top: "roi_pool" roi_pooling_param { pooled_w: 7
  pooled_h: 7 spatial_scale: 0.0625 } }

layer { name: "prop_score" type: "InnerProduct" bottom: "roi_pool" top: "prop_score"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  inner_product_param { num_output: 2 weight_filler { type: "xavier" } } }
layer { name: "prop_pred" type: "InnerProduct" bottom: "roi_pool" top: "prop_pred"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  inner_product_param { num_output: 8 weight_filler { type: "xavier" } } }
layer { name: "prop_prob" type: "Softmax" bottom: "prop_score" top: "prop_prob" }
layer { name: "proposal" type: "Python" bottom: "rois" bottom: "im_info"
  bottom: "prop_prob" bottom: "prop_pred" top: "rerank_rois"
  python_param { module: "refined_box.proposal_layer" layer: "ProposalLayer" } }
