name: "VGG_ILSVRC_16_layers"

input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 224
  dim: 224
}

input: "rois"
input_shape {
  dim: 1 # to be changed on-the-fly to num ROIs
  dim: 5 # [batch ind, x1, y1, x2, y2] zero-based indexing
}

input: "im_info"
input_shape {
  dim: 1
  dim: 3
}

layer { name: "conv1_1" type: "Convolution" bottom: "data" top: "conv1_1"
  convolution_param { num_output: 64 pad: 1 kernel_size: 3 } }
layer { name: "relu1_1" type: "ReLU" bottom: "conv1_1" top: "conv1_1" }
layer { name: "conv1_2" type: "Convolution" bottom: "conv1_1" top: "conv1_2"
  convolution_param { num_output: 64 pad: 1 kernel_size: 3 } }
layer { name: "relu1_2" type: "ReLU" bottom: "conv1_2" top: "conv1_2" }
layer { name: "pool1" type: "Pooling" bottom: "conv1_2" top: "pool1"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }

layer { name: "conv2_1" type: "Convolution" bottom: "pool1" top: "conv2_1"
  convolution_param { num_output: 128 pad: 1 kernel_size: 3 } }
layer { name: "relu2_1" type: "ReLU" bottom: "conv2_1" top: "conv2_1" }
layer { name: "conv2_2" type: "Convolution" bottom: "conv2_1" top: "conv2_2"
  convolution_param { num_output: 128 pad: 1 kernel_size: 3 } }
layer { name: "relu2_2" type: "ReLU" bottom: "conv2_2" top: "conv2_2" }
layer { name: "pool2" type: "Pooling" bottom: "conv2_2" top: "pool2"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }

layer { name: "conv3_1" type: "Convolution" bottom: "pool2" top: "conv3_1"
  convolution_param { num_output: 256 pad: 1 kernel_size: 3 } }
layer { name: "relu3_1" type: "ReLU" bottom: "conv3_1" top: "conv3_1" }
layer { name: "conv3_2" type: "Convolution" bottom: "conv3_1" top: "conv3_2"
  convolution_param { num_output: 256 pad: 1 kernel_size: 3 } }
layer { name: "relu3_2" type: "ReLU" bottom: "conv3_2" top: "conv3_2" }
layer { name: "conv3_3" type: "Convolution" bottom: "conv3_2" top: "conv3_3"
  convolution_param { num_output: 256 pad: 1 kernel_size: 3 } }
layer { name: "relu3_3" type: "ReLU" bottom: "conv3_3" top: "conv3_3" }
layer { name: "pool3" type: "Pooling" bottom: "conv3_3" top: "pool3"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }

layer { name: "conv4_1" type: "Convolution" bottom: "pool3" top: "conv4_1"
  convolution_param { num_output: 512 pad: 1 kernel_size: 3 } }
layer { name: "relu4_1" type: "ReLU" bottom: "conv4_1" top: "conv4_1" }
layer { name: "conv4_2" type: "Convolution" bottom: "conv4_1" top: "conv4_2"
  convolution_param { num_output: 512 pad: 1 kernel_size: 3 } }
layer { name: "relu4_2" type: "ReLU" bottom: "conv4_2" top: "conv4_2" }
layer { name: "conv4_3" type: "Convolution" bottom: "conv4_2" top: "conv4_3"
  convolution_param { num_output: 512 pad: 1 kernel_size: 3 } }
layer { name: "relu4_3" type: "ReLU" bottom: "conv4_3" top: "conv4_3" }
layer { name: "pool4" type: "Pooling" bottom: "conv4_3" top: "pool4"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }

layer { name: "conv5_1" type: "Convolution" bottom: "pool4" top: "conv5_1"
  convolution_param { num_output: 512 pad: 1 kernel_size: 3 } }
layer { name: "relu5_1" type: "ReLU" bottom: "conv5_1" top: "conv5_1" }
layer { name: "conv5_2" type: "Convolution" bottom: "conv5_1" top: "conv5_2"
  convolution_param { num_output: 512 pad: 1 kernel_size: 3 } }
layer { name: "relu5_2" type: "ReLU" bottom: "conv5_2" top: "conv5_2" }
layer { name: "conv5_3" type: "Convolution" bottom: "conv5_2" top: "conv5_3"
  convolution_param { num_output: 512 pad: 1 kernel_size: 3 } }
layer { name: "relu5_3" type: "ReLU" bottom: "conv5_3" top: "conv5_3" }

#==================== object proposal ====================
layer {
  name: "hybrid_prop"
  type: "Convolution"
  bottom: "conv5_3"
  top: "hybrid_prop"
  convolution_param {
    num_output: 128 pad: 1 kernel_size: 3
  }
}
layer {
  name: "relu_prop"
  type: "ReLU"
  bottom: "hybrid_prop"
  top: "hybrid_prop"
}
layer {
  name: "roi_pool_prop"
  type: "ROIPooling"
  bottom: "hybrid_prop"
  bottom: "rois"
  top: "roi_pool_prop"
  roi_pooling_param {
    pooled_w: 7 pooled_h: 7 spatial_scale: 0.0625
  }
}
layer {
  name: "fc_prop"
  type: "InnerProduct"
  bottom: "roi_pool_prop"
  top: "fc_prop"
  inner_product_param {
    num_output: 512
  }
}
layer {
  name: "relu_prop"
  type: "ReLU"
  bottom: "fc_prop"
  top: "fc_prop"
}

layer {
  name: "prop_score"
  type: "InnerProduct"
  bottom: "fc_prop"
  top: "prop_score"
  inner_product_param {
    num_output: 2
  }
}
layer {
  name: "prop_pred"
  type: "InnerProduct"
  bottom: "fc_prop"
  top: "prop_pred"
  inner_product_param {
    num_output: 8
  }
}
layer {
  name: "prop_prob"
  type: "Softmax"
  bottom: "prop_score"
  top: "prop_prob"
}
layer {
  name: "proposal"
  type: "Python"
  bottom: "rois"
  bottom: "im_info"
  bottom: "prop_prob"
  bottom: "prop_pred"
  top: "rerank_rois"
  python_param {
    module: "refined_box.proposal_layer"
    layer: "ProposalLayer"
  }
}

#==================== object detection ====================
layer {
  name: "roi_pool_detection"
  type: "ROIPooling"
  bottom: "conv5_3"
  bottom: "rerank_rois"
  top: "pool5"
  roi_pooling_param {
    pooled_w: 7 pooled_h: 7 spatial_scale: 0.0625
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6"
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  inner_product_param {
    num_output: 4096
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "cls_score"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score"
  inner_product_param {
    num_output: 21
  }
}
layer {
  name: "bbox_pred"
  type: "InnerProduct"
  bottom: "fc7"
  top: "bbox_pred"
  inner_product_param {
    num_output: 84
  }
}
layer {
  name: "cls_prob"
  type: "Softmax"
  bottom: "cls_score"
  top: "cls_prob"
}
